YII/advanced/frontend/models/SignupForm.php

INSERT INTO `user` (`username`, `email`, `id_curso`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('Afonso Mafra Silva', 'ams@icomp.ufam.edu.br', 1, '$2y$13$2LT8sptl52dUoJevvk9QouUevZlL7m42biLFQRa9dogRtyArBT92y', 'LKNkSpkHiyRj9qnTXMQrmO-LpafteigR', 10, 1499902221, 1499902221)
---
    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->id_curso = $this->id_curso;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;