YII/advanced/frontend/controllers/CursoController.php

    public function actionView($id)
    {
     $model = Curso::findOne(['id' => $id]);

     if($model == null) {
         $model = Curso::findOne(['sigla' => 'IE08']);
     }

     $num_users = User::find()->where('id_curso =' . $model->id)->count();
---
SELECT * FROM `curso` WHERE `id`='1'
SELECT COUNT(*) FROM `user` WHERE id_curso =1

 public function actionUsers($id){
     $model = Curso::findOne(['id' => $id]);
---
SELECT * FROM `curso` WHERE `id`='1'